; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	image1 - mode
	spectrograph2 - mode
	image3 - mode
	spectrograph0 - mode
	Star2 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Star10 - direction
	Star0 - direction
	GroundStation1 - direction
	Star9 - direction
	Star7 - direction
	GroundStation8 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 spectrograph2)
	(supports instrument0 image3)
	(calibration_target instrument0 Star10)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 spectrograph2)
	(supports instrument1 image3)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument2 spectrograph2)
	(supports instrument2 image1)
	(supports instrument2 image3)
	(calibration_target instrument2 Star10)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 image3)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 Star0)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
	(supports instrument4 image3)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 Star9)
	(supports instrument5 spectrograph2)
	(supports instrument5 spectrograph0)
	(supports instrument5 image3)
	(calibration_target instrument5 Star7)
	(supports instrument6 spectrograph2)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation8)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon12)
)
(:goal (and
	(pointing satellite0 Star0)
	(pointing satellite2 Star10)
	(have_image Planet11 image3)
	(have_image Phenomenon12 spectrograph0)
	(have_image Star13 spectrograph0)
	(have_image Phenomenon14 spectrograph0)
	(have_image Star15 spectrograph2)
	(have_image Star16 image1)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 8
2. (calibrate satellite1 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 0 of 8
3. (turn_to satellite1 star15 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star15)
   goals met: 0 of 8
4. (take_image satellite1 star15 instrument2 spectrograph2)
   added: (have_image star15 spectrograph2)
   goals met: 1 of 8
5. (turn_to satellite1 planet11 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 planet11)
   goals met: 1 of 8
6. (turn_to satellite0 groundstation3 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 groundstation3)
   goals met: 1 of 8
7. (take_image satellite1 planet11 instrument2 image3)
   added: (have_image planet11 image3)
   goals met: 2 of 8
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 8
9. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 2 of 8
10. (turn_to satellite0 phenomenon12 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 8
11. (take_image satellite0 phenomenon12 instrument0 spectrograph0)
   added: (have_image phenomenon12 spectrograph0)
   goals met: 3 of 8
12. (turn_to satellite0 phenomenon14 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon14)
   goals met: 3 of 8
13. (take_image satellite0 phenomenon14 instrument0 spectrograph0)
   added: (have_image phenomenon14 spectrograph0)
   goals met: 4 of 8
14. (turn_to satellite0 star13 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 star13)
   goals met: 4 of 8
15. (take_image satellite0 star13 instrument0 spectrograph0)
   added: (have_image star13 spectrograph0)
   goals met: 5 of 8
16. (turn_to satellite0 star0 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star0)
   goals met: 6 of 8
17. (turn_to satellite1 star16 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 star16)
   goals met: 6 of 8
18. (take_image satellite1 star16 instrument2 image1)
   added: (have_image star16 image1)
   goals met: 7 of 8
19. (turn_to satellite2 star10 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 star10)
   goals met: 8 of 8
